app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails"
---
  def index
    @emails = Email.all

INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "libero"], ["body", "Quisquam amet suscipit. Cum aut velit. Ut ipsam sit."], ["created_at", "2022-11-24 20:07:51.612236"], ["updated_at", "2022-11-24 20:07:51.612236"]]
---
  def create
    @email = Email.new(
      object: Faker::Lorem.word,
       body: Faker::Lorem.paragraph
       )

    respond_to do |format|
      if @email.save

UPDATE "emails" SET "object" = $1, "body" = $2, "updated_at" = $3 WHERE "emails"."id" = $4  [["object", "onfaitdestests"], ["body", "blabla tous ça c'est nul."], ["updated_at", "2022-11-24 20:08:26.742006"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @email.update(email_params)

DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 4]]
---
  def destroy
    @email.destroy

SELECT "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_email
      @email = Email.find(params[:id])